tutorials-OpenFOAM-v1706/multiRegionReactingFoam/multiRegionReactingFoamTutorial/constant/bottomAir/reactions
species
(
    O2
    N2
);

reactions
{
}
